req.xml

<soapenv:Envelope xmlns:inf="http://infocomercial.cifin.asobancaria.com" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Timestamp wsu:Id="TS-609AF1C618CA2F7BB8167078470883324"><wsu:Created>2022-12-11T18:51:48.833Z</wsu:Created><wsu:Expires>2022-12-11T21:38:28.833Z</wsu:Expires></wsu:Timestamp><ds:Signature Id="SIG-609AF1C618CA2F7BB8167078470881323" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="inf soapenv xsd xsi" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-609AF1C618CA2F7BB8167078470881022"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="inf xsd xsi" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>T2WHPacB9Iue8lDhGDweuRzSIog=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>M+PC4icRqsHKhW+oPP3u/jQxXU02/wTzKmkNNkrIMjVc1tYxqSPJg8LGXQaA95fBhIQy05YEQz3lgW35zhXXBZnjXgZAnTHYKHQ09DZz1s7ueV9sD5faZ7Tf8NeBTXC4hPFFhFBUOw/0udeMkw7Uhn8/t1fLt4gR8lErwGFQtIAw7BtHSVXCXiAd8NGdgJ5A8QQCitLcGY6Hd1vLem6y3oOr+0g2Gxjxz0GDovhJH9srDQJRLOZuJ/PwHSkX0WZstSuH+JqvlNlqVfp8XceEel5W5b/Ddirmy/5NNffFCN5s4nCWGLfsbn0HVe5tD+73s1gL2Zinws70REw4YvJ6qeMrxSGV+khrwQVqNvpdFe80gltpu2jDBBWh+c/FKAU8h5FSknknHnvcpP7AU1TBtRIVLV71aAS5fUn0CBzXe0T18kpL9jutcnYZoFwS5DOnkXwHoOQ76BbGses2C3i65rXd2Ei1LfSt5k4gvBNzcTrxfNSfC/ePywHCyzmSBGFHj02pIzcKRYXXsDUzFqJnjFaZGMY1NswJNGjcyLNiZ4h4rQdxeQBGTLhbSB/dYej6GmI3EKk+h/bchxUIGsVlvY2YCyogVpPsnSO9E00SgRnF3HRZkyMlk69l6ihoxAH7m+9/WpDB/E/Kmn9CxExY60A/wBhsk2ix+xIOKlOFB8I=</ds:SignatureValue><ds:KeyInfo Id="KI-609AF1C618CA2F7BB8167078470881020"><wsse:SecurityTokenReference wsu:Id="STR-609AF1C618CA2F7BB8167078470881021"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=*.crediscore.co</ds:X509IssuerName><ds:X509SerialNumber>701958465195975363928029716549400644846424809112</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header><soapenv:Body wsu:Id="id-609AF1C618CA2F7BB8167078470881022" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><inf:consultaXml soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><in0 xsi:type="dto:ParametrosConsultaDTO" xmlns:dto="http://dto.infocomercial.cifin.asobancaria.com"><codigoInformacion xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">1855</codigoInformacion><motivoConsulta xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">24</motivoConsulta><numeroIdentificacion xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">37685317</numeroIdentificacion><tipoIdentificacion xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">1</tipoIdentificacion></in0></inf:consultaXml></soapenv:Body></soapenv:Envelope>